system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
para {#include        "../ParametersMesh"}

// Type of mesh generation:
//  - castellated (default)
//  - castellatedBufferLayer
// type            castellatedBufferLayer;


// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       $para/addLayers;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    hull.stl
    {
        type triSurfaceMesh;
        name hull;

        patchInfo
        {
            type wall;
        }
    }

    boxRegion1
    {
        para {#include        "../ParametersMesh"}
        type searchableBox;
        min $para.boxRegion1Min;
        max $para.boxRegion1Max;
    }

    boxRegion2
    {
        para {#include        "../ParametersMesh"}
        type searchableBox;
        min $para.boxRegion2Min;
        max $para.boxRegion2Max;
    }

    cylinderRegion
    {
        para {#include        "../ParametersMesh"}
        type    searchableCylinder;
        point1  $para.cylinderRegionPoint1;
        point2  $para.cylinderRegionPoint2;
        radius  $para.cylinderRegionRadius;
    }

    // Sphere Region
    sphereRegion
    {
        para {#include        "../ParametersMesh"}
        type    searchableSphere;
        center  $para.sphereRegionCenter;
        origin  $para.sphereRegionCenter;
        radius  $para.sphereRegionRadius;
    }
}


// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    para {#include        "../ParametersMesh"}

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells $para/maxLocalCells;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells $para/maxGlobalCells;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels $para/nCellsBetweenLevels;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
         {
            file "hull.eMesh";
            level $para/edgeRefinementLevel; 
         }
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        hull
        {
            para {#include        "../ParametersMesh"}
            // Surface-wise min and max refinement level
            level $para/surfaceRefinementLevel; 
        }
    }

    resolveFeatureAngle $para/resolveFeatureAngle;


    // Additional refinement for regions of high curvature. Expressed
    // (bit similar to gapLevel) as:
    // - number of cells per radius of curvature. (usually a few is
    //   good enough)
    // - starting cell level? Not used at the moment.
    // - maximum cell level. This can be smaller or larger than the
    //   max 'surface' level
    // - minimum curvature radius to ignore (expressed as a cell level).
    //   This can be used to avoid detecting small sharp surface
    //   features. Set to -1 to ignore.
    //
    // curvatureLevel (10 0 10 -1);
    // https://www.openfoam.com/news/main-news/openfoam-v2212/pre-processing



    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        hull // not included in original settings
        {
            para {#include        "../ParametersMesh"}
            mode distance;
            levels $para/regionRefinementLevels;
        }

        boxRegion1
        {   
            para {#include        "../ParametersMesh"}
            mode inside;           
            levels ((1 $para.boxRegion1RefinementLevels));
        }

        boxRegion2
        {   
            para {#include        "../ParametersMesh"}
            mode inside;           
            levels ((1 $para.boxRegion2RefinementLevels));
        }

        cylinderRegion
        {   
            para {#include        "../ParametersMesh"}
            mode inside;           
            levels ((1 $para.cylinderRegionRefinementLevels));
        }

        sphereRegion
        {   
            para {#include        "../ParametersMesh"}
            mode inside;           
            levels ((1 $para.sphereRegionRefinementLevels));
        }
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh $para/locationInMesh;


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 3;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    //    tolerance 4.0;
    tolerance 1.0; // original 1.0

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 100;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping 
    // Number of feature edge snapping iterations.
    // Leave out altogether to disable.
    nFeatureSnapIter 10;

    // // Detect (geometric only) features by sampling the surface
    // // (default=false).
    // implicitFeatureSnap false;

    // // Use castellatedMeshControls::features (default = true)
    // explicitFeatureSnap true;

    // // Detect features between multiple surfaces
    // // (only for explicitFeatureSnap, default = false)
    // multiRegionFeatureSnap false;

    // for castellatedBufferLayer
    solver  displacementPointSmoothing;
    displacementPointSmoothingCoeffs
    {
        // Use laplacian to untangle problem areas
        pointSmoother           laplacian;
        nPointSmootherIter      10;
    }
}



// Settings for the layer addition.
addLayersControls
{
    para {#include        "../ParametersMesh"}
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes $para/relativeSizes;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        hull
        {
            para {#include        "../ParametersMesh"}
            nSurfaceLayers $para/nPrismLayers;

        }
    }

    thicknessModel $para/thicknessModel;

    // Only the thickness or expansion ratio that is used need to be present, if not it will overwrite the other one.
    // Expansion factor for layer mesh
    expansionRatio $para/expansionRatio;

    // // Wanted thickness of the layer next to the wall.
    // // If relativeSizes this is relative to undistorted size of cell
    // // outside layer.;
    firstLayerThickness $para/firstLayerThickness;

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness $para/finalLayerThickness;

    // // Total thickness of layers of points outside surface
    // thickness $para/thickness;
    overallThickness $para/overallThickness;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // See relativeSizes parameter.
    minThickness $para/minLayerThickness;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 1.7.x! (didn't do anything in 1.7.x)
    nGrow 0;


    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    // Note: featureAngle was wrong in v1712 and earlier. To obtain previous
    //       behaviour (extrude all edges, including sharp ones) use following
    //       settings. This is important for this geometry since we do want
    //       layers at the leading edge of the hull.
    featureAngle $para/layerFeatureAngle;
    // When two surfaces upon which layers are built are connected, the mesh may or may not be shrunk depending on the settings. When the angle between the two surfaces is smaller then parameter featureAngle value, the mesh will shrink in the corner from both surfaces.

    // Specified to be consistent with v1712 settings (see 1806 release notes)
    mergePatchFacesAngle 60;    // featureAngle, ori 60
    layerTerminationAngle 30;   // 0.5*featureAngle, ori 30
    slipFeatureAngle 30;        // 0.5*featureAngle, ori 30

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 1.7.x! 90 degrees corresponds to 130
    // in 1.7.x.
    minMedialAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;

    // Add layers in multiple passes - gives layers a chance to rotate
    nOuterIter      1; // 3, improved layers

    // Max number of iterations after which relaxed meshQuality controls
    // get used. Up to nRelaxIter it uses the settings in meshQualityControls,
    // after nRelaxIter it uses the values in meshQualityControls::relaxed.
    nRelaxedIter 20;

    // for DisplacementMotionSolver mesh shrinker, https://www.openfoam.com/news/main-news/openfoam-v2312/pre-processing#snappy_layers
    // https://www.openfoam.com/documentation/guides/latest/doc/guide-meshing-snappyhexmesh-layers.html
    meshShrinker    displacementMotionSolver;
    solver          displacementLaplacian;
    displacementLaplacianCoeffs
    {
        diffusivity     quadratic inverseDistance (hull);
    }

    // new hybrid layer input, https://www.openfoam.com/news/main-news/openfoam-v20-12/pre-processing#pre-processing-snappyhexmesh-hybrid-layer-input
    // relativeSizes false;
    // thicknessModel firstAndRelativeFinal;
    // firstLayerThickness 0.004; // absolute
    // finalLayerThickness 1.0; // relative

    // overallThickness 0.6;
    // expansionRatio 1.5;
    // possible options
    // model	                firstLayer	finalLayer	overall	expansion
    // firstAndOverall	            V	        .	        V	    .
    // firstAndExpansion	        V	        .	        .	    V
    // finalAndOverall      	    .	        V	        V	    .
    // finalAndExpansion    	    .	        V	        .	    V
    // overallAndExpansion  	    .	        .	        V	    V
    // firstAndRelativeFinal	    V	        V	        .	    . 

}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"
}


// Advanced

// Flags for optional output
// 0 : only write final meshes
// 1 : write intermediate meshes
// 2 : write volScalarField with cellLevel for postprocessing
// 4 : write current intersections as .obj files
debug 0;


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1E-6;


// ************************************************************************* //
